GopalSaraf/Practicals/PSDL/include/proc/pic16f1719.inc
// Register: SLRCOND
#define SLRCOND SLRCOND
SLRCOND                                  equ 030Fh
// bitfield definitions
SLRCOND_SLRD0_POSN                       equ 0000h
SLRCOND_SLRD0_POSITION                   equ 0000h
SLRCOND_SLRD0_SIZE                       equ 0001h
SLRCOND_SLRD0_LENGTH                     equ 0001h
SLRCOND_SLRD0_MASK                       equ 0001h
SLRCOND_SLRD1_POSN                       equ 0001h
SLRCOND_SLRD1_POSITION                   equ 0001h
SLRCOND_SLRD1_SIZE                       equ 0001h
SLRCOND_SLRD1_LENGTH                     equ 0001h
SLRCOND_SLRD1_MASK                       equ 0002h
SLRCOND_SLRD2_POSN                       equ 0002h
SLRCOND_SLRD2_POSITION                   equ 0002h
SLRCOND_SLRD2_SIZE                       equ 0001h
SLRCOND_SLRD2_LENGTH                     equ 0001h
SLRCOND_SLRD2_MASK                       equ 0004h
SLRCOND_SLRD3_POSN                       equ 0003h
SLRCOND_SLRD3_POSITION                   equ 0003h
SLRCOND_SLRD3_SIZE                       equ 0001h
SLRCOND_SLRD3_LENGTH                     equ 0001h
SLRCOND_SLRD3_MASK                       equ 0008h
SLRCOND_SLRD4_POSN                       equ 0004h
SLRCOND_SLRD4_POSITION                   equ 0004h
SLRCOND_SLRD4_SIZE                       equ 0001h
SLRCOND_SLRD4_LENGTH                     equ 0001h
SLRCOND_SLRD4_MASK                       equ 0010h
SLRCOND_SLRD5_POSN                       equ 0005h
SLRCOND_SLRD5_POSITION                   equ 0005h
SLRCOND_SLRD5_SIZE                       equ 0001h
SLRCOND_SLRD5_LENGTH                     equ 0001h
SLRCOND_SLRD5_MASK                       equ 0020h
SLRCOND_SLRD6_POSN                       equ 0006h
SLRCOND_SLRD6_POSITION                   equ 0006h
SLRCOND_SLRD6_SIZE                       equ 0001h
SLRCOND_SLRD6_LENGTH                     equ 0001h
SLRCOND_SLRD6_MASK                       equ 0040h
SLRCOND_SLRD7_POSN                       equ 0007h
SLRCOND_SLRD7_POSITION                   equ 0007h
SLRCOND_SLRD7_SIZE                       equ 0001h
SLRCOND_SLRD7_LENGTH                     equ 0001h
SLRCOND_SLRD7_MASK                       equ 0080h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 0310h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: INLVLA
#define INLVLA INLVLA
INLVLA                                   equ 038Ch
// bitfield definitions
INLVLA_INLVLA0_POSN                      equ 0000h
INLVLA_INLVLA0_POSITION                  equ 0000h
INLVLA_INLVLA0_SIZE                      equ 0001h
INLVLA_INLVLA0_LENGTH                    equ 0001h
INLVLA_INLVLA0_MASK                      equ 0001h
INLVLA_INLVLA1_POSN                      equ 0001h
INLVLA_INLVLA1_POSITION                  equ 0001h
INLVLA_INLVLA1_SIZE                      equ 0001h
INLVLA_INLVLA1_LENGTH                    equ 0001h
INLVLA_INLVLA1_MASK                      equ 0002h
INLVLA_INLVLA2_POSN                      equ 0002h
INLVLA_INLVLA2_POSITION                  equ 0002h
INLVLA_INLVLA2_SIZE                      equ 0001h
INLVLA_INLVLA2_LENGTH                    equ 0001h
INLVLA_INLVLA2_MASK                      equ 0004h
INLVLA_INLVLA3_POSN                      equ 0003h
INLVLA_INLVLA3_POSITION                  equ 0003h
INLVLA_INLVLA3_SIZE                      equ 0001h
INLVLA_INLVLA3_LENGTH                    equ 0001h
INLVLA_INLVLA3_MASK                      equ 0008h
INLVLA_INLVLA4_POSN                      equ 0004h
INLVLA_INLVLA4_POSITION                  equ 0004h
INLVLA_INLVLA4_SIZE                      equ 0001h
INLVLA_INLVLA4_LENGTH                    equ 0001h
INLVLA_INLVLA4_MASK                      equ 0010h
INLVLA_INLVLA5_POSN                      equ 0005h
INLVLA_INLVLA5_POSITION                  equ 0005h
INLVLA_INLVLA5_SIZE                      equ 0001h
INLVLA_INLVLA5_LENGTH                    equ 0001h
INLVLA_INLVLA5_MASK                      equ 0020h
INLVLA_INLVLA6_POSN                      equ 0006h
INLVLA_INLVLA6_POSITION                  equ 0006h
INLVLA_INLVLA6_SIZE                      equ 0001h
INLVLA_INLVLA6_LENGTH                    equ 0001h
INLVLA_INLVLA6_MASK                      equ 0040h
INLVLA_INLVLA7_POSN                      equ 0007h
INLVLA_INLVLA7_POSITION                  equ 0007h
INLVLA_INLVLA7_SIZE                      equ 0001h
INLVLA_INLVLA7_LENGTH                    equ 0001h
INLVLA_INLVLA7_MASK                      equ 0080h

// Register: INLVLB
#define INLVLB INLVLB
INLVLB                                   equ 038Dh
// bitfield definitions
INLVLB_INLVLB0_POSN                      equ 0000h
INLVLB_INLVLB0_POSITION                  equ 0000h
INLVLB_INLVLB0_SIZE                      equ 0001h
INLVLB_INLVLB0_LENGTH                    equ 0001h
INLVLB_INLVLB0_MASK                      equ 0001h
INLVLB_INLVLB1_POSN                      equ 0001h
INLVLB_INLVLB1_POSITION                  equ 0001h
INLVLB_INLVLB1_SIZE                      equ 0001h
INLVLB_INLVLB1_LENGTH                    equ 0001h
INLVLB_INLVLB1_MASK                      equ 0002h
INLVLB_INLVLB2_POSN                      equ 0002h
INLVLB_INLVLB2_POSITION                  equ 0002h
INLVLB_INLVLB2_SIZE                      equ 0001h
INLVLB_INLVLB2_LENGTH                    equ 0001h
INLVLB_INLVLB2_MASK                      equ 0004h
INLVLB_INLVLB3_POSN                      equ 0003h
INLVLB_INLVLB3_POSITION                  equ 0003h
INLVLB_INLVLB3_SIZE                      equ 0001h
INLVLB_INLVLB3_LENGTH                    equ 0001h
INLVLB_INLVLB3_MASK                      equ 0008h
INLVLB_INLVLB4_POSN                      equ 0004h
INLVLB_INLVLB4_POSITION                  equ 0004h
INLVLB_INLVLB4_SIZE                      equ 0001h
INLVLB_INLVLB4_LENGTH                    equ 0001h
INLVLB_INLVLB4_MASK                      equ 0010h
INLVLB_INLVLB5_POSN                      equ 0005h
INLVLB_INLVLB5_POSITION                  equ 0005h
INLVLB_INLVLB5_SIZE                      equ 0001h
INLVLB_INLVLB5_LENGTH                    equ 0001h
INLVLB_INLVLB5_MASK                      equ 0020h
INLVLB_INLVLB6_POSN                      equ 0006h
INLVLB_INLVLB6_POSITION                  equ 0006h
INLVLB_INLVLB6_SIZE                      equ 0001h
INLVLB_INLVLB6_LENGTH                    equ 0001h
INLVLB_INLVLB6_MASK                      equ 0040h
INLVLB_INLVLB7_POSN                      equ 0007h
INLVLB_INLVLB7_POSITION                  equ 0007h
INLVLB_INLVLB7_SIZE                      equ 0001h
INLVLB_INLVLB7_LENGTH                    equ 0001h
INLVLB_INLVLB7_MASK                      equ 0080h

